//package com.ex.route_service.enums;
//
///**
// * Статус транспортного средства в системе.
// */
//public enum VehicleStatus {
//    /**
//     * Транспортное средство активно и доступно для использования.
//     */
//    ACTIVE,
//
//    /**
//     * Транспортное средство в эксплуатации, используется курьером.
//     */
//    BUSY,
//
//    /**
//     * Транспортное средство недоступно из-за технической неисправности.
//     */
//    BROKEN,
//
//    /**
//     * Транспортное средство проходит техническое обслуживание или проверку.
//     */
//    MAINTENANCE,
//
//    /**
//     * Транспортное средство временно неактивно (например, вне сезона).
//     */
//    INACTIVE,
//
//    /**
//     * Виртуальный статус — используется для пеших курьеров.
//     */
//    ON_FOOT
//}
